In [1]:
import pandas as pd

In [2]:
obj = pd.Series([4,7,-5,10])

In [3]:
obj

0     4
1     7
2    -5
3    10
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5, 10])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4,5,6,2], index = ['a','b','c','d'])

In [7]:
obj2

a    4
b    5
c    6
d    2
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:

obj2['a']
obj2['c']

6

In [10]:
obj2[['a','b','d']]

a    4
b    5
d    2
dtype: int64

In [11]:
'b' in obj2

True

In [12]:
'e' in obj2

False

In [13]:
my_dict = {10: 'Akshat', 20: 'ishita', 30: 'anshul'}

In [14]:
pd.Series(my_dict)

10    Akshat
20    ishita
30    anshul
dtype: object

In [15]:
dataf = pd.Series(my_dict,index = [10,30,20,40])
dataf

10    Akshat
30    anshul
20    ishita
40       NaN
dtype: object

In [16]:
pd.isnull(dataf)

10    False
30    False
20    False
40     True
dtype: bool

In [17]:
dataf.name = "family"

In [18]:
dataf

10    Akshat
30    anshul
20    ishita
40       NaN
Name: family, dtype: object

In [19]:
dataf.index.name = "relation"

In [20]:
dataf

relation
10    Akshat
30    anshul
20    ishita
40       NaN
Name: family, dtype: object

In [21]:
data = {
    'state' : ["haryana","delhi","UP","MP"],
    'year' : [2010,2020,2015,2012],
    'pop' : [1.5,20,30,40]
}

In [22]:
frame = pd.DataFrame(data)

In [23]:
frame

     state  year   pop
0  haryana  2010   1.5
1    delhi  2020  20.0
2       UP  2015  30.0
3       MP  2012  40.0

In [24]:
frame["debt"] = 16.5

In [25]:
import  numpy as np
frame["debt"] = np.arange(4)

In [26]:
frame

     state  year   pop  debt
0  haryana  2010   1.5     0
1    delhi  2020  20.0     1
2       UP  2015  30.0     2
3       MP  2012  40.0     3

In [27]:
frame['populated'] = frame['pop'] >= 30

In [28]:
frame

     state  year   pop  debt  populated
0  haryana  2010   1.5     0      False
1    delhi  2020  20.0     1      False
2       UP  2015  30.0     2       True
3       MP  2012  40.0     3       True

In [29]:
frame['debt to year'] = frame['year'] + frame['debt'] / 100

In [30]:
frame

     state  year   pop  debt  populated  debt to year
0  haryana  2010   1.5     0      False       2010.00
1    delhi  2020  20.0     1      False       2020.01
2       UP  2015  30.0     2       True       2015.02
3       MP  2012  40.0     3       True       2012.03

In [31]:
frame.index.name = 's.no'

In [32]:
frame

        state  year   pop  debt  populated  debt to year
s.no
0     haryana  2010   1.5     0      False       2010.00
1       delhi  2020  20.0     1      False       2020.01
2          UP  2015  30.0     2       True       2015.02
3          MP  2012  40.0     3       True       2012.03

In [33]:
frame.name = 'State Data'

In [34]:
frame

        state  year   pop  debt  populated  debt to year
s.no
0     haryana  2010   1.5     0      False       2010.00
1       delhi  2020  20.0     1      False       2020.01
2          UP  2015  30.0     2       True       2015.02
3          MP  2012  40.0     3       True       2012.03

In [35]:
frame.columns.name = 'stats'

In [36]:
frame

stats    state  year   pop  debt  populated  debt to year
s.no
0      haryana  2010   1.5     0      False       2010.00
1        delhi  2020  20.0     1      False       2020.01
2           UP  2015  30.0     2       True       2015.02
3           MP  2012  40.0     3       True       2012.03

In [37]:
frame.values

array([['haryana', 2010, 1.5, 0, False, 2010.0],
       ['delhi', 2020, 20.0, 1, False, 2020.01],
       ['UP', 2015, 30.0, 2, True, 2015.02],
       ['MP', 2012, 40.0, 3, True, 2012.03]], dtype=object)

In [38]:
obj

0     4
1     7
2    -5
3    10
dtype: int64

In [39]:
obj = pd.Series(np.arange(4),index = ['a','b','c','d'])

In [40]:
obj

a    0
b    1
c    2
d    3
dtype: int64

In [41]:
obj.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [42]:
indexes = obj.index

In [43]:
indexes

Index(['a', 'b', 'c', 'd'], dtype='object')

In [44]:
indexes[:-1]

Index(['a', 'b', 'c'], dtype='object')

In [45]:
indexes[:]

Index(['a', 'b', 'c', 'd'], dtype='object')

In [46]:
labels  = pd.Index(['a','b','c','d'])

In [47]:
obj.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [48]:
obj2.index is labels

False

In [49]:
obj = pd.Series([4,5,3,7],index = ['d','b','c','a'])

In [50]:
obj

d    4
b    5
c    3
a    7
dtype: int64

In [51]:
obj2 = obj.reindex(['a','b','c','d'])

In [52]:
obj2

a    7
b    5
c    3
d    4
dtype: int64

In [53]:
obj2.reindex(['Something'])
obj2

a    7
b    5
c    3
d    4
dtype: int64

In [54]:
obj3 = pd.Series(['blue','yellow','green'],index = [0,2,4])

In [55]:
obj3

0      blue
2    yellow
4     green
dtype: object

In [56]:
obj3.reindex(range(6),method = 'ffill')

0      blue
1      blue
2    yellow
3    yellow
4     green
5     green
dtype: object

In [57]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),
                     index = ['a','c','d'],
                     columns = ['Ohio','Texas','California'])

In [58]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [59]:
frame2 = frame.reindex(['a','b','c','d'])

In [60]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [61]:
states = ["Haryana","Delhi","gujarat","Ohio","Texas"]

In [62]:
dummy_frame = frame2.reindex(states,axis = 'columns')

In [63]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [64]:
frame2.drop('c',inplace=True)
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
d   6.0    7.0         8.0

In [65]:
dummy_frame

   Haryana  Delhi  gujarat  Ohio  Texas
a      NaN    NaN      NaN   0.0    1.0
b      NaN    NaN      NaN   NaN    NaN
c      NaN    NaN      NaN   3.0    4.0
d      NaN    NaN      NaN   6.0    7.0

In [66]:
dummy_frame.drop(["Haryana","Delhi","gujarat"],axis="columns")

   Ohio  Texas
a   0.0    1.0
b   NaN    NaN
c   3.0    4.0
d   6.0    7.0

In [67]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
d   6.0    7.0         8.0

In [68]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
d   6.0    7.0         8.0

In [69]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [70]:
frame > 1

    Ohio  Texas  California
a  False  False        True
c   True   True        True
d   True   True        True

In [71]:

frame[frame["Ohio"]>1]

   Ohio  Texas  California
c     3      4           5
d     6      7           8

In [72]:
frame.fillna(10,inplace= True)

In [73]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [74]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [75]:
frame.loc[['a','d'],['Texas']]

   Texas
a      1
d      7

In [76]:
frame.iloc[[0,1],[1]]

   Texas
a      1
c      4

In [77]:
frame[:]

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [81]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3),columns=list('bcd'),index = ['Ohio','Colorado','Utah'])

In [82]:
df1

          b  c  d
Ohio      0  1  2
Colorado  3  4  5
Utah      6  7  8

In [83]:
df2 = pd.DataFrame(np.arange(9).reshape(3,3),columns=list('bde'),index = ['Ohio','Colorado','Washington'])

In [84]:
df2

            b  d  e
Ohio        0  1  2
Colorado    3  4  5
Washington  6  7  8

In [89]:
df3 = df1 + df2

In [90]:
df3.loc['Colorado','c'] = 10

In [91]:
df3

              b     c    d   e
Colorado    6.0  10.0  9.0 NaN
Ohio        0.0   NaN  3.0 NaN
Utah        NaN   NaN  NaN NaN
Washington  NaN   NaN  NaN NaN

In [96]:
df3 = df1.add(df2,fill_value=0)

In [97]:
df3

              b     c    d    e
Colorado    6.0  10.0  9.0  5.0
Ohio        0.0   1.0  3.0  2.0
Utah        6.0   7.0  8.0  NaN
Washington  6.0   NaN  7.0  8.0

In [98]:
df1.reindex(columns = df2.columns, fill_value=0)

          b  d  e
Ohio      0  2  0
Colorado  3  5  0
Utah      6  8  0

In [99]:
df3

              b     c    d    e
Colorado    6.0  10.0  9.0  5.0
Ohio        0.0   1.0  3.0  2.0
Utah        6.0   7.0  8.0  NaN
Washington  6.0   NaN  7.0  8.0

In [100]:
series  = df3.iloc[1]

In [101]:
series

b    0.0
c    1.0
d    3.0
e    2.0
Name: Ohio, dtype: object

In [102]:
df3 - series

              b    c    d    e
Colorado    6.0  9.0  6.0  3.0
Ohio        0.0  0.0  0.0  0.0
Utah        6.0  6.0  5.0  NaN
Washington  6.0  NaN  4.0  6.0

In [103]:
series2 = pd.Series(range(3),index  = ['b','e','h'])

In [104]:
series2

b    0
e    1
h    2
dtype: int64

In [105]:
series + series2

b    0.0
c    NaN
d    NaN
e    3.0
h    NaN
dtype: object

In [106]:
series2+df3

              b    c   d    e   h
Colorado    6.0  NaN NaN  6.0 NaN
Ohio        0.0  NaN NaN  3.0 NaN
Utah        6.0  NaN NaN  NaN NaN
Washington  6.0  NaN NaN  9.0 NaN

In [107]:
f = lambda x: x -10

In [108]:
f

In [111]:
df3.apply(f,axis = "columns")

               b    c    d    e
Colorado    -4.0  0.0 -1.0 -5.0
Ohio       -10.0 -9.0 -7.0 -8.0
Utah        -4.0 -3.0 -2.0  NaN
Washington  -4.0  NaN -3.0 -2.0

In [112]:
df3.abs()

              b     c    d    e
Colorado    6.0  10.0  9.0  5.0
Ohio        0.0   1.0  3.0  2.0
Utah        6.0   7.0  8.0  NaN
Washington  6.0   NaN  7.0  8.0

In [118]:
df3

              b     c    d    e
Colorado    6.0  10.0  9.0  5.0
Ohio        0.0   1.0  3.0  2.0
Utah        6.0   7.0  8.0  NaN
Washington  6.0   NaN  7.0  8.0

In [121]:
df3.sort_index(axis = 1,kind = 'mergesort')

              b     c    d    e
Colorado    6.0  10.0  9.0  5.0
Ohio        0.0   1.0  3.0  2.0
Utah        6.0   7.0  8.0  NaN
Washington  6.0   NaN  7.0  8.0

In [124]:
df3

              b     c    d    e
Colorado    6.0  10.0  9.0  5.0
Ohio        0.0   1.0  3.0  2.0
Utah        6.0   7.0  8.0  NaN
Washington  6.0   NaN  7.0  8.0

In [129]:
df3.sum(axis = 1)

Colorado      30.0
Ohio           6.0
Utah          21.0
Washington    21.0
dtype: object

In [130]:
df3.describe()

         b         d    e
count  4.0  4.000000  3.0
mean   4.5  6.750000  5.0
std    3.0  2.629956  3.0
min    0.0  3.000000  2.0
25%    4.5  6.000000  3.5
50%    6.0  7.500000  5.0
75%    6.0  8.250000  6.5
max    6.0  9.000000  8.0

In [133]:
df3.cumsum(axis = 0)

               b     c     d     e
Colorado     6.0  10.0   9.0   5.0
Ohio         6.0  11.0  12.0   7.0
Utah        12.0  18.0  20.0   NaN
Washington  18.0   NaN  27.0  15.0

In [134]:
df3.count()

b    4
c    3
d    4
e    3
dtype: int64

In [136]:
df3

              b     c    d    e
Colorado    6.0  10.0  9.0  5.0
Ohio        0.0   1.0  3.0  2.0
Utah        6.0   7.0  8.0  NaN
Washington  6.0   NaN  7.0  8.0

In [139]:
bool_v = df3.isin([6])

In [140]:
df3[bool_v]

              b    c   d   e
Colorado    6.0  NaN NaN NaN
Ohio        NaN  NaN NaN NaN
Utah        6.0  NaN NaN NaN
Washington  6.0  NaN NaN NaN